app/Controllers/nav/Dokumennav.php

SELECT *
FROM `tbl_dokumen`
ORDER BY `tgl_dokumen` DESC
---
    public function index()
    {
        $data['dokumen'] = $this->ModelDokumennav->orderBy('tgl_dokumen', 'DESC')->findAll();