app/Controllers/nav/Gallerynav.php

SELECT *
FROM `tbl_galeri`
ORDER BY `tgl_galeri` DESC
---
    public function index()
    {
        // Load model
        $ModelGallerynav = new ModelGallerynav();

        // Get all gallery data
        $data['gallery'] = $ModelGallerynav->orderBy('tgl_galeri', 'DESC')->findAll();