app/Controllers/nav/Layanannav.php

    public function index()
    {
        $data['dokumen'] = $this->Modellayanannav->orderBy('tgl_dokumen', 'DESC')->findAll();
---
SELECT *
FROM `tbl_layanan`
ORDER BY `tgl_dokumen` DESC