app/Controllers/Berita.php

    public function UpdateData($id_berita)
    {
        // Ambil file gambar dari form
        $fileGambar = $this->request->getFile('gambar_berita');

        // Siapkan array data untuk update
        $data = [
            'id_berita' => $id_berita,
            'judul_berita' => $this->request->getPost('judul_berita'),
            'isi_berita' => $this->request->getPost('isi_berita'),
        ];

        // Jika ada file gambar yang diupload
        if ($fileGambar && $fileGambar->isValid() && !$fileGambar->hasMoved()) {
            // Tentukan folder tujuan dan nama file
            $folderTujuan = 'C:/xampp/htdocs/rebrandingweb/public/foto'; // Ganti dengan path folder yang sesuai
            $fileName = $fileGambar->getRandomName(); // Mendapatkan nama file acak

            // Pindahkan file ke folder tujuan
            $fileGambar->move($folderTujuan, $fileName);

            // Tambahkan nama file ke data yang akan diupdate
            $data['gambar_berita'] = $fileName;

            // Opsional: Hapus file lama jika ada (ambil nama file lama dari database)
            $beritaLama = $this->ModelBerita->find($id_berita); // Pastikan fungsi `find` ada di model Anda
---
SELECT *
FROM `tbl_berita`
WHERE `tbl_berita`.`id_berita` = '22'