app/Controllers/Home.php

SELECT *
FROM `tbl_berita`
 LIMIT 6
SELECT COUNT(*) AS `numrows`
FROM `tbl_berita`
---
    public function index(): string
    {
        // Konfigurasi pagination
        $page = $this->request->getVar('page') ?? 1;
        $perPage = 6; // Jumlah berita per halaman

        $data = [
            'judul' => 'Home',
            'page' => 'v_home',
            'berita' => $this->ModelBerita->paginate($perPage, 'default', $page),
            'pager' => $this->ModelBerita->pager,
        ];