app/Models/ModelAuth.php

SELECT *
FROM `tbl_admin`
WHERE `username` = 'admin'
AND `password` = '7110eda4d09e062aa5e4a390b0a572ac0d2c0220'
---
    public function LoginUser($username, $password){
        return $this->db->table('tbl_admin')
            ->where([
                'username' => $username,
                'password' => $password,
                // 'level' => $level,
            ])->get()->getRowArray();