app/Models/ModelBerita.php

    public function AllData()
    {
        return $this->db->table('tbl_berita')
        ->get()->getResultArray();
---
SELECT *
FROM `tbl_berita`

    public function InsertData($data){
        $this->db->table('tbl_berita')->insert($data);
---
INSERT INTO `tbl_berita` (`judul_berita`, `isi_berita`, `gambar_berita`) VALUES ('Es teh ', '<p>Es teh menjadi berita hangat&nbsp;<span style=\"color: rgb(100, 107, 107); font-family: __fontSerif_c35935, __fontSerif_Fallback_c35935, serif; font-size: 20px; font-weight: var(--bs-body-font-weight); text-align: var(--bs-body-text-align);\">Lorem ipsum dolor sit amet, consectetur adipiscing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua.</span></p>', '1733106053_a7702280d4456aaf0905.jpg')

    public function UpdateData($data){
        $this->db->table('tbl_berita')
        ->where('id_berita', $data['id_berita'])
        ->update($data);
---
UPDATE `tbl_berita` SET `id_berita` = '22', `judul_berita` = 'naga goreng', `isi_berita` = NULL, `gambar_berita` = '1733067212_f93715d459be7b181bdf.png'
WHERE `id_berita` = '22'

    public function DeleteData($data){
        $this->db->table('tbl_berita')
        ->where('id_berita', $data['id_berita'])
        ->delete($data);
---
SELECT *
FROM `tbl_berita`
WHERE `id_berita` = '24'
 LIMIT 1