app/Models/ModelGaleri.php

    public function AllData()
    {
        return $this->db->table('tbl_galeri')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_galeri`

    public function InsertData($data)
    {
        $this->db->table('tbl_galeri')->insert($data);
---
INSERT INTO `tbl_galeri` (`judul_galeri`, `file_galeri`, `tgl_galeri`, `jam_galeri`) VALUES ('', '1733219816_7d474d68193d5895e9af.jpg', '2024-12-03', '16:56:56')