app/Models/ModelNelayan.php

    public function AllData()
    {
        return $this->db->table('tbl_nelayan')
        ->get()->getResultArray();
---
SELECT *
FROM `tbl_nelayan`