app/Models/ModelDokumen.php

    public function AllData()
    {
        return $this->db->table('tbl_dokumen')
            ->get()->getResultArray();
---
SELECT *
FROM `tbl_dokumen`

    public function DeleteData($data)
    {
        $this->db->table('tbl_dokumen')
            ->where('id_dokumen', $data['id_dokumen'])
            ->delete($data);
---
DELETE FROM `tbl_dokumen`
WHERE `id_dokumen` = '7'
AND `id_dokumen` = '7'